Revit 2027 API
SpecTypeId.Boolean Class
 This class contains constants identifying Boolean specs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpecTypeId.Boolean
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Boolean
Public NotInheritable Class Boolean
public ref class Boolean abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Boolean = class end
The SpecTypeId.Boolean type exposes the following members.
Properties
Name | Description
YesNo |  Yes/No, in discipline Common.
Top
See Also
Reference
Autodesk.Revit.DB Namespace